# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLO11n with P2/4 + P3/8 + P4/16 + P5/32 detection heads
# P2 head added for small-object detection (shrunken kernels, damaged kernels)

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2  ← P2 features (skip target)
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4  ← P3 features (skip target)
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 2, C3k2, [512, True]]       # 6  ← P4 features (skip target)
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]         # 9
  - [-1, 2, C2PSA, [1024]]           # 10 ← P5 features (skip target)

head:
  # --- top-down pathway: P5 → P4 → P3 → P2 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                  # 13 P4 fusion

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                  # 16 P3 fusion

  # NEW: upsample P3 → P2 and fuse with backbone P2 features
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17 NEW
  - [[-1, 2], 1, Concat, [1]]                    # 18 NEW cat backbone P2
  - [-1, 2, C3k2, [128, False]]                  # 19 NEW P2/4 output (small objects)

  # --- bottom-up pathway: P2 → P3 → P4 → P5 ---
  - [-1, 1, Conv, [128, 3, 2]]                   # 20 NEW downsample P2→P3
  - [[-1, 16], 1, Concat, [1]]                   # 21 NEW cat P3 fusion
  - [-1, 2, C3k2, [256, False]]                  # 22 P3/8 output

  - [-1, 1, Conv, [256, 3, 2]]                   # 23 downsample P3→P4
  - [[-1, 13], 1, Concat, [1]]                   # 24 cat P4 fusion
  - [-1, 2, C3k2, [512, False]]                  # 25 P4/16 output

  - [-1, 1, Conv, [512, 3, 2]]                   # 26 downsample P4→P5
  - [[-1, 10], 1, Concat, [1]]                   # 27 cat backbone P5
  - [-1, 2, C3k2, [1024, True]]                  # 28 P5/32 output

  - [[19, 22, 25, 28], 1, Detect, [nc]]          # Detect(P2, P3, P4, P5)