# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, 1, 0.25, 1, True, 'ghost']]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, 1, 0.25, 1, True, 'ghost']]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, 1, 0.5, 1, True, 'ghost']]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, 1, 0.5, 1, True, 'ghost']]
  - [-1, 1, SPPF, [1024, 5]]    # 9
  - [-1, 2, C2PSA, [1024]]      # 10

# YOLO11 head — default P3 + P4 + P5 three-scale
# CARAFE args: [in_channels, scale_factor]
head:

  # Top-down path (semantic info flows DOWN)

  - [-1,       1, CARAFE, [1024, 2]]        # 11  P5 20x20 -> 40x40  (replaces nn.Upsample)
  - [[-1, 6],  1, Concat, [1]]              # 12  cat backbone P4 (layer 6)
  - [-1,       2, C3k2,   [512, 1, 0.5, 1, True, 'ghost']]     # 13  fused P4

  - [-1,       1, CARAFE, [512, 2]]         # 14  P4 40x40 -> 80x80  (replaces nn.Upsample)
  - [[-1, 4],  1, Concat, [1]]              # 15  cat backbone P3 (layer 4)
  - [-1,       2, C3k2,   [256, 1, 0.5, 1, True, 'bottleneck']]     # 16  P3/8-small

  # Bottom-up path (spatial detail flows UP)

  - [-1,       1, Conv,   [256, 3, 2]]      # 17  P3 80x80 -> 40x40  (strided conv, unchanged)
  - [[-1, 13], 1, Concat, [1]]              # 18  cat head P4 (layer 13)
  - [-1,       2, C3k2,   [512, 1, 0.5, 1, True, 'bottleneck']]     # 19  P4/16-medium

  - [-1,       1, Conv,   [512, 3, 2]]      # 20  P4 40x40 -> 20x20  (strided conv, unchanged)
  - [[-1, 10], 1, Concat, [1]]              # 21  cat head P5 (layer 10)
  - [-1,       2, C3k2,   [1024, 1, 0.5, 1, True, 'ghost']]     # 22  P5/32-large

  # Detection
  - [[16, 19, 22], 1, Detect, [nc]]         # 23  P3 + P4 + P5