# custom-yolo11-repvit.yaml
nc: 10
scales:
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]]              # 0-P1/2  initial stem conv
  - [-1, 1, RepViTBlock, [64, 2]]          # 1-P2/4  downsample
  - [-1, 1, RepViTBlock, [64, 1]]          # 2       basic block

  - [-1, 1, RepViTBlock, [128, 2]]         # 3-P3/8  downsample
  - [-1, 1, RepViTBlock, [128, 1]]         # 4       ← P3 skip target

  - [-1, 1, RepViTBlock, [256, 2]]         # 5-P4/16 downsample
  - [-1, 1, RepViTBlock, [256, 1]]         # 6       ← P4 skip target

  - [-1, 1, RepViTBlock, [512, 2]]         # 7-P5/32 downsample
  - [-1, 1, RepViTBlock, [512, 1]]         # 8

  - [-1, 1, Conv, [1024, 1, 1]]            # 9  channel expansion
  - [-1, 1, SPPF, [1024, 5]]              # 10
  - [-1, 2, C2PSA, [1024]]               # 11 ← neck entry (safe: 1024×0.25=256)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, Concat, [1]]                    # 13 cat backbone P4
  - [-1, 2, C3k2, [256, False]]                  # 14 P4 fusion

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, Concat, [1]]                    # 16 cat backbone P3
  - [-1, 2, C3k2, [128, False]]                  # 17 P3/8 output

  - [-1, 1, Conv, [128, 3, 2]]                   # 18
  - [[-1, 14], 1, Concat, [1]]                   # 19 cat P4 fusion
  - [-1, 2, C3k2, [256, False]]                  # 20 P4/16 output

  - [-1, 1, Conv, [256, 3, 2]]                   # 21
  - [[-1, 11], 1, Concat, [1]]                   # 22 cat backbone P5
  - [-1, 2, C3k2, [512, False]]                  # 23 P5/32 output

  - [[17, 20, 23], 1, Detect, [nc]]              # Detect(P3, P4, P5)