nc: 10
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv,   [64, 3, 2]]               # 0-P1/2
  - [-1, 1, Conv,   [128, 3, 2]]              # 1-P2/4
  - [-1, 2, C3k2,   [256, False, 0.25]]       # 2
  - [-1, 1, Conv,   [256, 3, 2]]              # 3-P3/8
  - [-1, 2, C3k2,   [512, False, 0.25]]       # 4  ← P3 skip
  - [-1, 1, Conv,   [512, 3, 2]]              # 5-P4/16
  - [-1, 2, C3k2,   [512, True]]              # 6  ← P4 skip
  - [-1, 1, Conv,   [1024, 3, 2]]             # 7-P5/32
  - [-1, 2, C3k2,   [1024, True]]             # 8
  - [-1, 1, SPPF,   [1024, 5]]               # 9
  - [-1, 2, C2PSA,  [1024]]                  # 10 ← C2PSA kept

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]]                 # 12 cat P4
  - [-1, 2, C3k2,   [512, False]]             # 13 P4 fusion
  - [-1, 1, ChannelAttention, [512]]          # 14 ← SE on P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]]                 # 16 cat P3
  - [-1, 2, C3k2,   [256, False]]             # 17 P3 fusion
  - [-1, 1, ChannelAttention, [256]]          # 18 ← SE on P3

  - [-1, 1, Conv,   [256, 3, 2]]              # 19
  - [[-1, 13], 1, Concat, [1]]                # 20 cat P4 fusion
  - [-1, 2, C3k2,   [512, False]]             # 21 P4/16 output

  - [-1, 1, Conv,   [512, 3, 2]]              # 22
  - [[-1, 10], 1, Concat, [1]]                # 23 cat P5
  - [-1, 2, C3k2,   [1024, True]]             # 24 P5/32 output

  - [[18, 21, 24], 1, Detect, [nc]]           # Detect(P3, P4, P5)