nc: 10
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [24, 3, 2]]                    # 0-P1/2
  - [-1, 1, ShuffleV2Block, [48, 2]]             # 1-P2/4
  - [-1, 1, ShuffleV2Block, [48, 1]]             # 2

  - [-1, 1, ShuffleV2Block, [96, 2]]             # 3-P3/8
  - [-1, 1, ShuffleV2Block, [96, 1]]             # 4       ← P3 skip target

  - [-1, 1, ShuffleV2Block, [192, 2]]            # 5-P4/16
  - [-1, 1, ShuffleV2Block, [192, 1]]            # 6       ← P4 skip target

  - [-1, 1, ShuffleV2Block, [384, 2]]            # 7-P5/32
  - [-1, 1, ShuffleV2Block, [384, 1]]            # 8
  
  - [-1, 1, Conv, [1024, 1, 1]]                  #9
  - [-1, 1, SPPF, [1024, 5]]                     # 10 SPPF operates on lightweight backbone channels
  - [-1, 2, C2PSA, [1024]]                       # 11 C2PSA receives expanded channels
  

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, Concat, [1]]                    # 13 cat backbone P4
  - [-1, 2, C3k2, [192, False]]                  # 14 P4 fusion

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, Concat, [1]]                    # 16 cat backbone P3
  - [-1, 2, C3k2, [96, False]]                   # 17 P3/8 output

  - [-1, 1, Conv, [96, 3, 2]]                    # 18
  - [[-1, 14], 1, Concat, [1]]                   # 19 cat P4 fusion
  - [-1, 2, C3k2, [192, False]]                  # 20 P4/16 output

  - [-1, 1, Conv, [192, 3, 2]]                   # 21
  - [[-1, 11], 1, Concat, [1]]                   # 22 cat backbone P5
  - [-1, 2, C3k2, [384, False]]                  # 23 P5/32 output

  - [[17, 20, 23], 1, Detect, [nc]]              # Detect(P3, P4, P5)