# custom-yolo11-spdconv.yaml
nc: 10
scales:
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  # SPDConv replaces all stride-2 Conv layers
  - [-1, 1, SPDConv, [64, 2]]             # 0  replaces Conv[64,3,2]  P1→P2
  - [-1, 1, SPDConv, [128, 2]]            # 1  replaces Conv[128,3,2] P2→P3
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, SPDConv, [256, 2]]            # 3  replaces Conv[256,3,2] P3→P4
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4  ← P3 skip target
  - [-1, 1, SPDConv, [512, 2]]            # 5  replaces Conv[512,3,2] P4→P5
  - [-1, 2, C3k2, [512, True]]            # 6  ← P4 skip target
  - [-1, 1, SPDConv, [1024, 2]]           # 7  replaces Conv[1024,3,2] P5→P6
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 2, C2PSA, [1024]]               # 10 ← P5 neck entry

# ── Head (SlimNeck) ────────────────────────────────────────────────────────────
head:
  # Top-down path — nn.Upsample stays, C3k2 → VoVGSCSP
  - [-1,       1, nn.Upsample,  [None, 2, "nearest"]]  # 11  P5 20×20 → 40×40
  - [[-1, 6],  1, Concat,       [1]]                   # 12  cat backbone P4
  - [-1,       2, VoVGSCSP,     [512, False]]           # 13  P4

  - [-1,       1, nn.Upsample,  [None, 2, "nearest"]]  # 14  P4 40×40 → 80×80
  - [[-1, 4],  1, Concat,       [1]]                   # 15  cat backbone P3
  - [-1,       2, VoVGSCSP,     [256, False]]           # 16  P3

  # Detection
  - [[16, 13], 1, Detect,       [nc]]                  # 17  P3 + P4