nc: 10
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [32, 3, 2]]          # 0-P1/2
  - [-1, 1, StarBlock, [32, 32]]       # 1

  - [-1, 1, Conv, [64, 3, 2]]          # 2-P2/4
  - [-1, 1, StarBlock, [64, 64]]       # 3  ← P2 skip

  - [-1, 1, Conv, [128, 3, 2]]         # 4-P3/8
  - [-1, 1, StarBlock, [128, 128]]     # 5  ← P3 skip

  - [-1, 1, Conv, [256, 3, 2]]         # 6-P4/16
  - [-1, 1, StarBlock, [256, 256]]     # 7  ← P4 skip
  
  - [-1, 1, Conv, [512, 3, 2]]         # 8-P5/32
  - [-1, 1, StarBlock, [512, 512]]     # 9  ← P5 skip

  - [-1, 1, SPPF, [1024, 5]]            # 10  ← neck entry
  
# ── Head (BiFPN neck) ─────────────────────────────────────────────────────────
head:

  # Top-down path: semantic info flows DOWN
  # Upsample unchanged — BiFPN only touches the fusion (Concat) nodes

  - [-1,       1, nn.Upsample,    [None, 2, "nearest"]]  # 11  P5 20x20 -> 40x40
  - [[-1, 6],  1, BiFPN_Concat2,  [1]]                   # 12  weighted fuse P4 (was Concat)
  - [-1,       2, C3k2,           [512, False]]           # 13  fused P4

  - [-1,       1, nn.Upsample,    [None, 2, "nearest"]]  # 14  P4 40x40 -> 80x80
  - [[-1, 4],  1, BiFPN_Concat2,  [1]]                   # 15  weighted fuse P3 (was Concat)
  - [-1,       2, C3k2,           [256, False]]           # 16  P3/8-small

  # Bottom-up path: spatial detail flows UP

  - [-1,       1, Conv,           [256, 3, 2]]            # 17  P3 80x80 -> 40x40
  - [[-1, 13], 1, BiFPN_Concat2,  [1]]                   # 18  weighted fuse P4 (was Concat)
  - [-1,       2, C3k2,           [512, False]]           # 19  P4/16-medium

  - [-1,       1, Conv,           [512, 3, 2]]            # 20  P4 40x40 -> 20x20
  - [[-1, 10], 1, BiFPN_Concat2,  [1]]                   # 21  weighted fuse P5 (was Concat)
  - [-1,       2, C3k2,           [1024, True]]           # 22  P5/32-large

  # Detection
  - [[16, 19, 22], 1, Detect,     [nc]]                  # 23  P3 + P4 + P5