nc: 10
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [32, 3, 2]]          # 0-P1/2
  - [-1, 1, StarBlock, [32, 32]]       # 1

  - [-1, 1, Conv, [64, 3, 2]]          # 2-P2/4
  - [-1, 1, StarBlock, [64, 64]]       # 3  ← P2 skip

  - [-1, 1, Conv, [128, 3, 2]]         # 4-P3/8
  - [-1, 1, StarBlock, [128, 128]]     # 5  ← P3 skip

  - [-1, 1, Conv, [256, 3, 2]]         # 6-P4/16
  - [-1, 1, StarBlock, [256, 256]]     # 7  ← P4 skip
  
  - [-1, 1, Conv, [512, 3, 2]]         # 8-P5/32
  - [-1, 1, StarBlock, [512, 512]]     # 9  ← P5 skip

  - [-1, 1, SPPF, [1024, 5]]            # 10  ← neck entry

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #11
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4 #12
  - [-1, 2, C3k2, [512, False]]  #13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #14
  - [[-1, 4], 1, Concat, [1]] # 15 cat backbone 
  - [-1, 2, C3k2, [128, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] #17
  - [[-1, 13], 1, Concat, [1]] #18 cat head P4
  - [-1, 2, C3k2, [256, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]#20
  - [[-1, 10], 1, Concat, [1]] #21 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)