# custom-yolo11-spdconv.yaml
nc: 10
scales:
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  # SPDConv replaces all stride-2 Conv layers
  - [-1, 1, SPDConv, [64, 2]]             # 0  replaces Conv[64,3,2]  P1→P2
  - [-1, 1, SPDConv, [128, 2]]            # 1  replaces Conv[128,3,2] P2→P3
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, SPDConv, [256, 2]]            # 3  replaces Conv[256,3,2] P3→P4
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4  ← P3 skip target
  - [-1, 1, SPDConv, [512, 2]]            # 5  replaces Conv[512,3,2] P4→P5
  - [-1, 2, C3k2, [512, True]]            # 6  ← P4 skip target
  - [-1, 1, SPDConv, [1024, 2]]           # 7  replaces Conv[1024,3,2] P5→P6
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 2, C2PSA, [1024]]               # 10 ← P5 neck entry
  
  # YOLO11 head — default P3 + P4 + P5 three-scale
# CARAFE args: [in_channels, scale_factor]
head:

  # Top-down path (semantic info flows DOWN)

  - [-1,       1, CARAFE, [1024, 2]]        # 11  P5 20x20 -> 40x40  (replaces nn.Upsample)
  - [[-1, 6],  1, Concat, [1]]              # 12  cat backbone P4 (layer 6)
  - [-1,       2, C3k2,   [512, False]]     # 13  fused P4

  - [-1,       1, CARAFE, [512, 2]]         # 14  P4 40x40 -> 80x80  (replaces nn.Upsample)
  - [[-1, 4],  1, Concat, [1]]              # 15  cat backbone P3 (layer 4)
  - [-1,       2, C3k2,   [256, False]]     # 16  P3/8-small

  # Bottom-up path (spatial detail flows UP)

  - [-1,       1, Conv,   [256, 3, 2]]      # 17  P3 80x80 -> 40x40  (strided conv, unchanged)
  - [[-1, 13], 1, Concat, [1]]              # 18  cat head P4 (layer 13)
  - [-1,       2, C3k2,   [512, False]]     # 19  P4/16-medium

  - [-1,       1, Conv,   [512, 3, 2]]      # 20  P4 40x40 -> 20x20  (strided conv, unchanged)
  - [[-1, 10], 1, Concat, [1]]              # 21  cat head P5 (layer 10)
  - [-1,       2, C3k2,   [1024, True]]     # 22  P5/32-large

  # Detection
  - [[16, 19, 22], 1, Detect, [nc]]         # 23  P3 + P4 + P5